testing/archive/load_test_4_24_2025__2_01_35_pm.log
2025-04-24 14:01:35,510 - Test start time: 4_24_2025__2_01_35_pm
2025-04-24 14:01:35,794 - Test Started: 16:1 rate: 40 pods: 1
2025-04-24 14:02:36,107 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 195.134ms, rate sampling interval: 430ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.39s     5.10s   15.64s    87.15%
    Req/Sec    34.05      4.30    48.00     82.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  824.83ms
 75.000%    1.02s 
 90.000%   15.61s 
 99.000%   15.63s 
 99.900%   15.64s 
 99.990%   15.65s 
 99.999%   15.65s 
100.000%   15.65s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.211     0.000000            1         1.00
       5.359     0.100000          173         1.11
       8.447     0.200000          346         1.25
      11.999     0.300000          519         1.43
      20.463     0.400000          692         1.67
     824.831     0.500000          864         2.00
     834.047     0.550000          952         2.22
     841.215     0.600000         1043         2.50
    1001.471     0.650000         1125         2.86
    1012.223     0.700000         1211         3.33
    1021.439     0.750000         1296         4.00
    1026.047     0.775000         1340         4.44
    1031.167     0.800000         1387         5.00
    1037.823     0.825000         1428         5.71
    1044.991     0.850000         1468         6.67
   15597.567     0.875000         1520         8.00
   15605.759     0.887500         1562         8.89
   15605.759     0.900000         1562        10.00
   15613.951     0.912500         1650        11.43
   15613.951     0.925000         1650        13.33
   15613.951     0.937500         1650        16.00
   15613.951     0.943750         1650        17.78
   15613.951     0.950000         1650        20.00
   15622.143     0.956250         1704        22.86
   15622.143     0.962500         1704        26.67
   15622.143     0.968750         1704        32.00
   15622.143     0.971875         1704        35.56
   15622.143     0.975000         1704        40.00
   15622.143     0.978125         1704        45.71
   15622.143     0.981250         1704        53.33
   15622.143     0.984375         1704        64.00
   15622.143     0.985938         1704        71.11
   15630.335     0.987500         1722        80.00
   15630.335     0.989062         1722        91.43
   15630.335     0.990625         1722       106.67
   15630.335     0.992188         1722       128.00
   15630.335     0.992969         1722       142.22
   15630.335     0.993750         1722       160.00
   15630.335     0.994531         1722       182.86
   15630.335     0.995313         1722       213.33
   15630.335     0.996094         1722       256.00
   15630.335     0.996484         1722       284.44
   15630.335     0.996875         1722       320.00
   15638.527     0.997266         1726       365.71
   15638.527     0.997656         1726       426.67
   15638.527     0.998047         1726       512.00
   15638.527     0.998242         1726       568.89
   15638.527     0.998437         1726       640.00
   15638.527     0.998633         1726       731.43
   15638.527     0.998828         1726       853.33
   15638.527     0.999023         1726      1024.00
   15638.527     0.999121         1726      1137.78
   15638.527     0.999219         1726      1280.00
   15638.527     0.999316         1726      1462.86
   15638.527     0.999414         1726      1706.67
   15646.719     0.999512         1727      2048.00
   15646.719     1.000000         1727          inf
#[Mean    =     2390.432, StdDeviation   =     5095.917]
#[Max     =    15638.528, Total count    =         1727]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2075 requests in 1.00m, 25.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:     34.57
Transfer/sec:    436.08KB

2025-04-24 14:02:36,402 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:02:36,671 - Test Started: 16:2 rate: 40 pods: 1
2025-04-24 14:03:36,977 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 150.236ms, rate sampling interval: 433ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.04s     8.57s   31.62s    91.77%
    Req/Sec    34.21      4.42    48.00     81.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  208.00ms
 75.000%    1.20s 
 90.000%    1.22s 
 99.000%   31.62s 
 99.900%   31.64s 
 99.990%   31.64s 
 99.999%   31.64s 
100.000%   31.64s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.121     0.000000            1         1.00
       6.347     0.100000          174         1.11
      11.743     0.200000          346         1.25
      19.615     0.300000          519         1.43
     196.735     0.400000          691         1.67
     207.999     0.500000          866         2.00
     835.071     0.550000          950         2.22
     848.895     0.600000         1036         2.50
    1023.999     0.650000         1125         2.86
    1190.911     0.700000         1217         3.33
    1197.055     0.750000         1313         4.00
    1198.079     0.775000         1339         4.44
    1200.127     0.800000         1382         5.00
    1202.175     0.825000         1429         5.71
    1204.223     0.850000         1471         6.67
    1207.295     0.875000         1515         8.00
    1210.367     0.887500         1534         8.89
    1216.511     0.900000         1555        10.00
    1226.751     0.912500         1575        11.43
   31604.735     0.925000         1634        13.33
   31604.735     0.937500         1634        16.00
   31604.735     0.943750         1634        17.78
   31621.119     0.950000         1715        20.00
   31621.119     0.956250         1715        22.86
   31621.119     0.962500         1715        26.67
   31621.119     0.968750         1715        32.00
   31621.119     0.971875         1715        35.56
   31621.119     0.975000         1715        40.00
   31621.119     0.978125         1715        45.71
   31621.119     0.981250         1715        53.33
   31621.119     0.984375         1715        64.00
   31621.119     0.985938         1715        71.11
   31621.119     0.987500         1715        80.00
   31621.119     0.989062         1715        91.43
   31621.119     0.990625         1715       106.67
   31621.119     0.992188         1715       128.00
   31621.119     0.992969         1715       142.22
   31637.503     0.993750         1726       160.00
   31637.503     1.000000         1726          inf
#[Mean    =     3041.320, StdDeviation   =     8567.373]
#[Max     =    31621.120, Total count    =         1726]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2079 requests in 1.00m, 25.73MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:     34.64
Transfer/sec:    439.00KB

2025-04-24 14:03:37,269 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:03:37,525 - Test Started: 16:3 rate: 40 pods: 1
2025-04-24 14:04:37,824 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 629.224ms, rate sampling interval: 2067ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39s     1.30s    5.23s    46.30%
    Req/Sec    33.79      1.78    37.00     79.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02s 
 75.000%    2.03s 
 90.000%    3.21s 
 99.000%    4.23s 
 99.900%    5.23s 
 99.990%    5.23s 
 99.999%    5.23s 
100.000%    5.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.195     0.000000            1         1.00
       7.251     0.100000          172         1.11
      13.207     0.200000          343         1.25
      24.383     0.300000          515         1.43
    1016.319     0.400000          692         1.67
    1021.951     0.500000          860         2.00
    1025.023     0.550000          963         2.22
    1028.607     0.600000         1033         2.50
    2019.327     0.650000         1116         2.86
    2024.447     0.700000         1206         3.33
    2033.663     0.750000         1289         4.00
    2087.935     0.775000         1330         4.44
    3026.943     0.800000         1378         5.00
    3031.039     0.825000         1415         5.71
    3041.279     0.850000         1463         6.67
    3201.023     0.875000         1506         8.00
    3203.071     0.887500         1523         8.89
    3209.215     0.900000         1560        10.00
    3211.263     0.912500         1577        11.43
    3213.311     0.925000         1589        13.33
    3221.503     0.937500         1608        16.00
    4206.591     0.943750         1628        17.78
    4210.687     0.950000         1644        20.00
    4210.687     0.956250         1644        22.86
    4214.783     0.962500         1662        26.67
    4214.783     0.968750         1662        32.00
    4218.879     0.971875         1680        35.56
    4218.879     0.975000         1680        40.00
    4218.879     0.978125         1680        45.71
    4222.975     0.981250         1692        53.33
    4222.975     0.984375         1692        64.00
    4222.975     0.985938         1692        71.11
    4227.071     0.987500         1698        80.00
    4227.071     0.989062         1698        91.43
    4231.167     0.990625         1702       106.67
    4231.167     0.992188         1702       128.00
    4268.031     0.992969         1704       142.22
    4272.127     0.993750         1706       160.00
    4272.127     0.994531         1706       182.86
    5201.919     0.995313         1708       213.33
    5206.015     0.996094         1709       256.00
    5206.015     0.996484         1709       284.44
    5214.207     0.996875         1710       320.00
    5222.399     0.997266         1712       365.71
    5222.399     0.997656         1712       426.67
    5222.399     0.998047         1712       512.00
    5222.399     0.998242         1712       568.89
    5226.495     0.998437         1714       640.00
    5226.495     0.998633         1714       731.43
    5226.495     0.998828         1714       853.33
    5226.495     0.999023         1714      1024.00
    5226.495     0.999121         1714      1137.78
    5226.495     0.999219         1714      1280.00
    5226.495     0.999316         1714      1462.86
    5226.495     0.999414         1714      1706.67
    5230.591     0.999512         1715      2048.00
    5230.591     1.000000         1715          inf
#[Mean    =     1392.364, StdDeviation   =     1302.619]
#[Max     =     5226.496, Total count    =         1715]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2062 requests in 1.00m, 24.99MB read
  Socket errors: connect 0, read 0, write 0, timeout 27
Requests/sec:     34.36
Transfer/sec:    426.34KB

2025-04-24 14:04:38,110 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:04:38,384 - Test Started: 16:4 rate: 40 pods: 1
2025-04-24 14:05:38,666 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 225.106ms, rate sampling interval: 1652ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.58s     8.22s   31.60s    92.24%
    Req/Sec    37.57      2.95    43.00     73.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.62ms
 75.000%  450.05ms
 90.000%    1.25s 
 99.000%   31.42s 
 99.900%   31.62s 
 99.990%   31.62s 
 99.999%   31.62s 
100.000%   31.62s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.585     0.000000            1         1.00
       4.591     0.100000          191         1.11
       6.151     0.200000          382         1.25
       8.439     0.300000          573         1.43
      10.983     0.400000          764         1.67
      13.623     0.500000          954         2.00
      15.175     0.550000         1052         2.22
      17.775     0.600000         1145         2.50
      22.575     0.650000         1241         2.86
      34.623     0.700000         1336         3.33
     450.047     0.750000         1431         4.00
     652.287     0.775000         1479         4.44
     828.415     0.800000         1527         5.00
     848.895     0.825000         1576         5.71
    1029.631     0.850000         1622         6.67
    1037.311     0.875000         1670         8.00
    1044.991     0.887500         1696         8.89
    1249.279     0.900000         1718        10.00
    1853.439     0.912500         1743        11.43
   30392.319     0.925000         1769        13.33
   30425.087     0.937500         1799        16.00
   30588.927     0.943750         1803        17.78
   30621.695     0.950000         1813        20.00
   30834.687     0.956250         1825        22.86
   30982.143     0.962500         1838        26.67
   30998.527     0.968750         1861        32.00
   30998.527     0.971875         1861        35.56
   30998.527     0.975000         1861        40.00
   31014.911     0.978125         1867        45.71
   31211.519     0.981250         1877        53.33
   31391.743     0.984375         1883        64.00
   31391.743     0.985938         1883        71.11
   31408.127     0.987500         1888        80.00
   31408.127     0.989062         1888        91.43
   31424.511     0.990625         1892       106.67
   31588.351     0.992188         1896       128.00
   31588.351     0.992969         1896       142.22
   31604.735     0.993750         1901       160.00
   31604.735     0.994531         1901       182.86
   31604.735     0.995313         1901       213.33
   31604.735     0.996094         1901       256.00
   31621.119     0.996484         1908       284.44
   31621.119     1.000000         1908          inf
#[Mean    =     2584.618, StdDeviation   =     8221.671]
#[Max     =    31604.736, Total count    =         1908]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2249 requests in 1.00m, 27.92MB read
  Socket errors: connect 0, read 3, write 7, timeout 15
Requests/sec:     37.48
Transfer/sec:    476.50KB

2025-04-24 14:05:38,944 - Test completed: wrk2 -t1 -c8 -d60s -R40 --latency http://128.105.146.155/
2025-04-24 14:05:39,225 - Test Started: 16:5 rate: 70 pods: 2
2025-04-24 14:06:39,582 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 18.544ms, rate sampling interval: 47ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.73ms    5.32ms  41.86ms   71.05%
    Req/Sec    70.36     58.38   173.00     53.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.77ms
 75.000%   13.01ms
 90.000%   16.00ms
 99.000%   27.15ms
 99.900%   36.90ms
 99.990%   41.89ms
 99.999%   41.89ms
100.000%   41.89ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.518     0.000000            1         1.00
       4.015     0.100000          350         1.11
       4.927     0.200000          700         1.25
       5.987     0.300000         1049         1.43
       7.231     0.400000         1400         1.67
       8.767     0.500000         1748         2.00
       9.543     0.550000         1923         2.22
      10.375     0.600000         2099         2.50
      11.279     0.650000         2273         2.86
      12.199     0.700000         2448         3.33
      13.007     0.750000         2622         4.00
      13.399     0.775000         2711         4.44
      13.823     0.800000         2797         5.00
      14.263     0.825000         2885         5.71
      14.831     0.850000         2973         6.67
      15.391     0.875000         3060         8.00
      15.671     0.887500         3104         8.89
      15.999     0.900000         3147        10.00
      16.383     0.912500         3191        11.43
      17.071     0.925000         3236        13.33
      18.159     0.937500         3278        16.00
      18.687     0.943750         3301        17.78
      19.199     0.950000         3322        20.00
      19.855     0.956250         3345        22.86
      20.655     0.962500         3365        26.67
      21.759     0.968750         3387        32.00
      22.127     0.971875         3398        35.56
      22.415     0.975000         3409        40.00
      23.103     0.978125         3420        45.71
      24.239     0.981250         3431        53.33
      24.975     0.984375         3443        64.00
      25.247     0.985938         3448        71.11
      25.583     0.987500         3453        80.00
      25.903     0.989062         3458        91.43
      27.663     0.990625         3464       106.67
      28.687     0.992188         3469       128.00
      29.135     0.992969         3472       142.22
      30.239     0.993750         3475       160.00
      30.447     0.994531         3477       182.86
      31.663     0.995313         3480       213.33
      33.503     0.996094         3484       256.00
      33.503     0.996484         3484       284.44
      33.599     0.996875         3486       320.00
      33.695     0.997266         3487       365.71
      33.855     0.997656         3488       426.67
      34.943     0.998047         3490       512.00
      34.943     0.998242         3490       568.89
      35.519     0.998437         3491       640.00
      36.191     0.998633         3492       731.43
      36.191     0.998828         3492       853.33
      36.895     0.999023         3493      1024.00
      36.895     0.999121         3493      1137.78
      38.783     0.999219         3494      1280.00
      38.783     0.999316         3494      1462.86
      38.783     0.999414         3494      1706.67
      40.415     0.999512         3495      2048.00
      40.415     0.999561         3495      2275.56
      40.415     0.999609         3495      2560.00
      40.415     0.999658         3495      2925.71
      40.415     0.999707         3495      3413.33
      41.887     0.999756         3496      4096.00
      41.887     1.000000         3496          inf
#[Mean    =        9.726, StdDeviation   =        5.315]
#[Max     =       41.856, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 52.12MB read
Requests/sec:     70.00
Transfer/sec:      0.87MB

2025-04-24 14:06:39,887 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 14:06:40,183 - Test Started: 16:6 rate: 70 pods: 2
2025-04-24 14:07:40,478 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 13.094ms, rate sampling interval: 38ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.84ms    5.63ms  45.79ms   74.97%
    Req/Sec    70.67     60.29   189.00     47.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.83ms
 75.000%   12.85ms
 90.000%   16.13ms
 99.000%   29.81ms
 99.900%   39.36ms
 99.990%   45.82ms
 99.999%   45.82ms
100.000%   45.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.764     0.000000            1         1.00
       3.975     0.100000          350         1.11
       4.967     0.200000          700         1.25
       6.067     0.300000         1050         1.43
       7.339     0.400000         1399         1.67
       8.831     0.500000         1749         2.00
       9.543     0.550000         1924         2.22
      10.295     0.600000         2098         2.50
      11.007     0.650000         2273         2.86
      11.959     0.700000         2448         3.33
      12.855     0.750000         2625         4.00
      13.295     0.775000         2711         4.44
      13.799     0.800000         2797         5.00
      14.239     0.825000         2887         5.71
      14.871     0.850000         2972         6.67
      15.391     0.875000         3059         8.00
      15.719     0.887500         3104         8.89
      16.135     0.900000         3147        10.00
      16.623     0.912500         3191        11.43
      17.599     0.925000         3235        13.33
      18.831     0.937500         3278        16.00
      19.439     0.943750         3300        17.78
      20.271     0.950000         3323        20.00
      21.199     0.956250         3344        22.86
      22.111     0.962500         3365        26.67
      23.167     0.968750         3387        32.00
      23.903     0.971875         3398        35.56
      24.495     0.975000         3409        40.00
      25.471     0.978125         3420        45.71
      26.255     0.981250         3431        53.33
      28.111     0.984375         3442        64.00
      28.367     0.985938         3447        71.11
      28.879     0.987500         3453        80.00
      29.711     0.989062         3458        91.43
      29.935     0.990625         3464       106.67
      31.407     0.992188         3469       128.00
      32.191     0.992969         3472       142.22
      32.735     0.993750         3475       160.00
      33.023     0.994531         3477       182.86
      33.471     0.995313         3480       213.33
      33.823     0.996094         3483       256.00
      35.199     0.996484         3484       284.44
      35.551     0.996875         3486       320.00
      35.615     0.997266         3487       365.71
      35.743     0.997656         3488       426.67
      36.767     0.998047         3490       512.00
      36.767     0.998242         3490       568.89
      37.343     0.998437         3491       640.00
      39.231     0.998633         3492       731.43
      39.231     0.998828         3492       853.33
      39.359     0.999023         3493      1024.00
      39.359     0.999121         3493      1137.78
      41.471     0.999219         3494      1280.00
      41.471     0.999316         3494      1462.86
      41.471     0.999414         3494      1706.67
      45.599     0.999512         3495      2048.00
      45.599     0.999561         3495      2275.56
      45.599     0.999609         3495      2560.00
      45.599     0.999658         3495      2925.71
      45.599     0.999707         3495      3413.33
      45.823     0.999756         3496      4096.00
      45.823     1.000000         3496          inf
#[Mean    =        9.836, StdDeviation   =        5.631]
#[Max     =       45.792, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 51.90MB read
Requests/sec:     70.00
Transfer/sec:      0.86MB

2025-04-24 14:07:40,781 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 14:07:41,071 - Test Started: 16:7 rate: 70 pods: 2
2025-04-24 14:08:41,361 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 16.678ms, rate sampling interval: 54ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.37ms    5.29ms  91.78ms   75.00%
    Req/Sec    70.34     52.74   150.00     56.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.43ms
 75.000%   12.41ms
 90.000%   15.47ms
 99.000%   24.59ms
 99.900%   37.63ms
 99.990%   91.84ms
 99.999%   91.84ms
100.000%   91.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.287     0.000000            1         1.00
       3.989     0.100000          350         1.11
       4.871     0.200000          700         1.25
       5.847     0.300000         1049         1.43
       7.079     0.400000         1399         1.67
       8.431     0.500000         1749         2.00
       9.151     0.550000         1925         2.22
       9.855     0.600000         2099         2.50
      10.663     0.650000         2275         2.86
      11.503     0.700000         2448         3.33
      12.407     0.750000         2623         4.00
      12.911     0.775000         2710         4.44
      13.407     0.800000         2797         5.00
      13.943     0.825000         2887         5.71
      14.455     0.850000         2973         6.67
      14.887     0.875000         3059         8.00
      15.127     0.887500         3104         8.89
      15.479     0.900000         3147        10.00
      15.767     0.912500         3193        11.43
      16.159     0.925000         3234        13.33
      16.703     0.937500         3278        16.00
      17.263     0.943750         3300        17.78
      17.919     0.950000         3322        20.00
      18.671     0.956250         3345        22.86
      19.359     0.962500         3365        26.67
      19.999     0.968750         3387        32.00
      20.383     0.971875         3398        35.56
      20.943     0.975000         3409        40.00
      21.263     0.978125         3420        45.71
      21.903     0.981250         3431        53.33
      22.591     0.984375         3442        64.00
      22.991     0.985938         3448        71.11
      24.015     0.987500         3453        80.00
      24.399     0.989062         3458        91.43
      24.815     0.990625         3464       106.67
      25.999     0.992188         3469       128.00
      27.983     0.992969         3472       142.22
      28.479     0.993750         3475       160.00
      28.943     0.994531         3477       182.86
      29.535     0.995313         3480       213.33
      31.279     0.996094         3483       256.00
      31.599     0.996484         3484       284.44
      32.703     0.996875         3486       320.00
      33.407     0.997266         3487       365.71
      34.335     0.997656         3488       426.67
      34.847     0.998047         3490       512.00
      34.847     0.998242         3490       568.89
      35.327     0.998437         3491       640.00
      37.151     0.998633         3492       731.43
      37.151     0.998828         3492       853.33
      37.631     0.999023         3493      1024.00
      37.631     0.999121         3493      1137.78
      46.047     0.999219         3494      1280.00
      46.047     0.999316         3494      1462.86
      46.047     0.999414         3494      1706.67
      87.487     0.999512         3495      2048.00
      87.487     0.999561         3495      2275.56
      87.487     0.999609         3495      2560.00
      87.487     0.999658         3495      2925.71
      87.487     0.999707         3495      3413.33
      91.839     0.999756         3496      4096.00
      91.839     1.000000         3496          inf
#[Mean    =        9.375, StdDeviation   =        5.289]
#[Max     =       91.776, Total count    =         3496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4201 requests in 1.00m, 51.78MB read
Requests/sec:     70.01
Transfer/sec:      0.86MB

2025-04-24 14:08:41,669 - Test completed: wrk2 -t1 -c8 -d60s -R70 --latency http://128.105.146.155/
2025-04-24 14:08:41,964 - Test Started: 16:8 rate: 110 pods: 3
2025-04-24 14:09:42,274 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 9.071ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.33ms    4.12ms  90.37ms   66.27%
    Req/Sec   111.75     71.34   296.00     54.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.53ms
 75.000%   11.25ms
 90.000%   14.13ms
 99.000%   17.07ms
 99.900%   30.67ms
 99.990%   40.26ms
 99.999%   90.43ms
100.000%   90.43ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.757     0.000000            1         1.00
       3.815     0.100000          551         1.11
       4.555     0.200000         1100         1.25
       5.387     0.300000         1650         1.43
       6.355     0.400000         2199         1.67
       7.531     0.500000         2749         2.00
       8.187     0.550000         3023         2.22
       8.895     0.600000         3300         2.50
       9.599     0.650000         3576         2.86
      10.359     0.700000         3848         3.33
      11.247     0.750000         4124         4.00
      11.727     0.775000         4260         4.44
      12.159     0.800000         4398         5.00
      12.639     0.825000         4537         5.71
      13.119     0.850000         4672         6.67
      13.647     0.875000         4812         8.00
      13.887     0.887500         4878         8.89
      14.127     0.900000         4948        10.00
      14.383     0.912500         5018        11.43
      14.695     0.925000         5084        13.33
      14.999     0.937500         5153        16.00
      15.135     0.943750         5188        17.78
      15.295     0.950000         5223        20.00
      15.407     0.956250         5258        22.86
      15.551     0.962500         5292        26.67
      15.703     0.968750         5325        32.00
      15.791     0.971875         5343        35.56
      15.855     0.975000         5360        40.00
      15.951     0.978125         5377        45.71
      16.119     0.981250         5394        53.33
      16.327     0.984375         5411        64.00
      16.463     0.985938         5419        71.11
      16.655     0.987500         5428        80.00
      16.911     0.989062         5436        91.43
      17.279     0.990625         5445       106.67
      17.759     0.992188         5454       128.00
      18.031     0.992969         5458       142.22
      18.367     0.993750         5462       160.00
      18.703     0.994531         5466       182.86
      19.215     0.995313         5471       213.33
      19.791     0.996094         5475       256.00
      20.271     0.996484         5477       284.44
      20.687     0.996875         5479       320.00
      21.295     0.997266         5481       365.71
      23.151     0.997656         5484       426.67
      24.543     0.998047         5486       512.00
      25.135     0.998242         5487       568.89
      25.407     0.998437         5488       640.00
      25.935     0.998633         5489       731.43
      30.463     0.998828         5490       853.33
      30.671     0.999023         5491      1024.00
      30.927     0.999121         5492      1137.78
      30.927     0.999219         5492      1280.00
      31.535     0.999316         5493      1462.86
      31.535     0.999414         5493      1706.67
      34.591     0.999512         5494      2048.00
      34.591     0.999561         5494      2275.56
      34.591     0.999609         5494      2560.00
      40.255     0.999658         5495      2925.71
      40.255     0.999707         5495      3413.33
      40.255     0.999756         5495      4096.00
      40.255     0.999780         5495      4551.11
      40.255     0.999805         5495      5120.00
      90.431     0.999829         5496      5851.43
      90.431     1.000000         5496          inf
#[Mean    =        8.328, StdDeviation   =        4.118]
#[Max     =       90.368, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 81.37MB read
  Socket errors: connect 0, read 14, write 0, timeout 0
Requests/sec:    110.00
Transfer/sec:      1.36MB

2025-04-24 14:09:42,563 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/
2025-04-24 14:09:42,860 - Test Started: 16:9 rate: 110 pods: 4
2025-04-24 14:10:43,160 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 8.417ms, rate sampling interval: 28ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.67ms    4.62ms  87.04ms   70.07%
    Req/Sec   111.73     69.89   285.00     55.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.64ms
 75.000%   11.68ms
 90.000%   14.75ms
 99.000%   21.81ms
 99.900%   30.45ms
 99.990%   64.61ms
 99.999%   87.10ms
100.000%   87.10ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.810     0.000000            1         1.00
       3.835     0.100000          552         1.11
       4.531     0.200000         1104         1.25
       5.431     0.300000         1649         1.43
       6.411     0.400000         2199         1.67
       7.643     0.500000         2748         2.00
       8.303     0.550000         3024         2.22
       9.119     0.600000         3298         2.50
       9.927     0.650000         3573         2.86
      10.807     0.700000         3849         3.33
      11.679     0.750000         4123         4.00
      12.143     0.775000         4260         4.44
      12.599     0.800000         4397         5.00
      13.087     0.825000         4535         5.71
      13.647     0.850000         4672         6.67
      14.175     0.875000         4811         8.00
      14.463     0.887500         4880         8.89
      14.751     0.900000         4947        10.00
      15.039     0.912500         5016        11.43
      15.375     0.925000         5084        13.33
      15.719     0.937500         5154        16.00
      15.887     0.943750         5187        17.78
      16.127     0.950000         5223        20.00
      16.447     0.956250         5256        22.86
      16.927     0.962500         5291        26.67
      17.855     0.968750         5326        32.00
      18.303     0.971875         5343        35.56
      18.703     0.975000         5359        40.00
      19.071     0.978125         5376        45.71
      19.439     0.981250         5393        53.33
      20.159     0.984375         5411        64.00
      20.575     0.985938         5419        71.11
      20.975     0.987500         5428        80.00
      21.391     0.989062         5436        91.43
      21.983     0.990625         5445       106.67
      22.463     0.992188         5454       128.00
      22.623     0.992969         5458       142.22
      22.767     0.993750         5462       160.00
      23.647     0.994531         5466       182.86
      24.271     0.995313         5471       213.33
      24.815     0.996094         5475       256.00
      24.895     0.996484         5477       284.44
      25.167     0.996875         5479       320.00
      25.391     0.997266         5481       365.71
      26.815     0.997656         5484       426.67
      28.415     0.998047         5486       512.00
      28.911     0.998242         5487       568.89
      29.711     0.998437         5488       640.00
      30.095     0.998633         5489       731.43
      30.287     0.998828         5490       853.33
      30.447     0.999023         5491      1024.00
      30.479     0.999121         5492      1137.78
      30.479     0.999219         5492      1280.00
      32.959     0.999316         5493      1462.86
      32.959     0.999414         5493      1706.67
      43.071     0.999512         5494      2048.00
      43.071     0.999561         5494      2275.56
      43.071     0.999609         5494      2560.00
      64.607     0.999658         5495      2925.71
      64.607     0.999707         5495      3413.33
      64.607     0.999756         5495      4096.00
      64.607     0.999780         5495      4551.11
      64.607     0.999805         5495      5120.00
      87.103     0.999829         5496      5851.43
      87.103     1.000000         5496          inf
#[Mean    =        8.668, StdDeviation   =        4.619]
#[Max     =       87.040, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 81.81MB read
Requests/sec:    110.01
Transfer/sec:      1.36MB

2025-04-24 14:10:43,474 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/
2025-04-24 14:10:43,762 - Test Started: 16:10 rate: 110 pods: 5
2025-04-24 14:11:44,069 - WRK2 Output:
Running 1m test @ http://128.105.146.155/
  1 threads and 8 connections
  Thread calibration: mean lat.: 7.960ms, rate sampling interval: 27ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.17ms    3.89ms  42.18ms   62.65%
    Req/Sec   111.82     71.42   296.00     47.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.36ms
 75.000%   11.10ms
 90.000%   13.94ms
 99.000%   16.64ms
 99.900%   23.61ms
 99.990%   32.30ms
 99.999%   42.21ms
100.000%   42.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.745     0.000000            1         1.00
       3.775     0.100000          552         1.11
       4.423     0.200000         1100         1.25
       5.251     0.300000         1650         1.43
       6.183     0.400000         2200         1.67
       7.355     0.500000         2748         2.00
       7.995     0.550000         3023         2.22
       8.783     0.600000         3300         2.50
       9.487     0.650000         3573         2.86
      10.287     0.700000         3848         3.33
      11.103     0.750000         4124         4.00
      11.567     0.775000         4260         4.44
      11.999     0.800000         4397         5.00
      12.479     0.825000         4536         5.71
      12.943     0.850000         4673         6.67
      13.479     0.875000         4812         8.00
      13.703     0.887500         4879         8.89
      13.951     0.900000         4949        10.00
      14.231     0.912500         5020        11.43
      14.431     0.925000         5088        13.33
      14.719     0.937500         5154        16.00
      14.879     0.943750         5189        17.78
      15.047     0.950000         5223        20.00
      15.207     0.956250         5258        22.86
      15.375     0.962500         5290        26.67
      15.559     0.968750         5327        32.00
      15.671     0.971875         5342        35.56
      15.767     0.975000         5360        40.00
      15.839     0.978125         5377        45.71
      15.951     0.981250         5394        53.33
      16.135     0.984375         5412        64.00
      16.263     0.985938         5419        71.11
      16.415     0.987500         5428        80.00
      16.543     0.989062         5436        91.43
      16.863     0.990625         5445       106.67
      17.023     0.992188         5454       128.00
      17.615     0.992969         5458       142.22
      17.807     0.993750         5462       160.00
      18.143     0.994531         5466       182.86
      18.591     0.995313         5471       213.33
      18.879     0.996094         5475       256.00
      19.119     0.996484         5477       284.44
      19.599     0.996875         5479       320.00
      19.775     0.997266         5481       365.71
      21.391     0.997656         5484       426.67
      21.823     0.998047         5486       512.00
      22.255     0.998242         5487       568.89
      22.367     0.998437         5488       640.00
      22.975     0.998633         5489       731.43
      23.599     0.998828         5490       853.33
      23.615     0.999023         5491      1024.00
      24.351     0.999121         5492      1137.78
      24.351     0.999219         5492      1280.00
      25.359     0.999316         5493      1462.86
      25.359     0.999414         5493      1706.67
      27.183     0.999512         5494      2048.00
      27.183     0.999561         5494      2275.56
      27.183     0.999609         5494      2560.00
      32.303     0.999658         5495      2925.71
      32.303     0.999707         5495      3413.33
      32.303     0.999756         5495      4096.00
      32.303     0.999780         5495      4551.11
      32.303     0.999805         5495      5120.00
      42.207     0.999829         5496      5851.43
      42.207     1.000000         5496          inf
#[Mean    =        8.175, StdDeviation   =        3.895]
#[Max     =       42.176, Total count    =         5496]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6601 requests in 1.00m, 80.55MB read
Requests/sec:    110.00
Transfer/sec:      1.34MB

2025-04-24 14:11:44,447 - Test completed: wrk2 -t1 -c8 -d60s -R110 --latency http://128.105.146.155/